**Two Sample Data Frames**

So that we don't have to keep re-defining data frames, we create a couple of them to refer to repeatedly below.

In [1]:
import pandas as pd
customer={'T12341':"George",'T12342':"Thomas",'T12343':"Josephine",'T12344':"Steve",'T12345':"James"}
amount={'T12341':12.75,'T12342':10.89,'T12343':4.67,'T12344':11.21,'T12345':4.00}
tax={'T12341':.64,'T12342':.55,'T12343':.24,'T12344':.46,'T12345':.15}
store={'T12341':1,'T12342':2,'T12343':3,'T12344':1,'T12345':2}
datetime={'T12341':'12:23:2018:12:38','T12342':'12:23:2018:12:45','T12343':'12:23:2018:12:45','T12344':'12:23:2018:12:47','T12345':'12:23:2018:12:49'}
payment_method={'T12341':"cash",'T12342':"charge",'T12343':"cash",'T12344':"charge",'T12345':"cash"}
d={"customer":customer,
   "amount":amount,
   "tax":tax,
   "store":store,
   "datetime":datetime,
   "payment_method":payment_method
  }
df1=pd.DataFrame(d)
print(df1)
df2=df1.copy()
#df2.set_index(['store','customer','datetime'],inplace=True)
print(df2)

         customer  amount   tax  store          datetime payment_method
T12341     George   12.75  0.64      1  12:23:2018:12:38           cash
T12342     Thomas   10.89  0.55      2  12:23:2018:12:45         charge
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash
T12344      Steve   11.21  0.46      1  12:23:2018:12:47         charge
T12345      James    4.00  0.15      2  12:23:2018:12:49           cash
         customer  amount   tax  store          datetime payment_method
T12341     George   12.75  0.64      1  12:23:2018:12:38           cash
T12342     Thomas   10.89  0.55      2  12:23:2018:12:45         charge
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash
T12344      Steve   11.21  0.46      1  12:23:2018:12:47         charge
T12345      James    4.00  0.15      2  12:23:2018:12:49           cash

**Boolean selections**

We can select by row using a Boolean list of the same length as the number of rows in the data frame.

In [2]:
L=[True,False,True,False,True]
print(df1[L])

         customer  amount   tax  store          datetime payment_method
T12341     George   12.75  0.64      1  12:23:2018:12:38           cash
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash
T12345      James    4.00  0.15      2  12:23:2018:12:49           cash

**Selecting Columns**

We can select a column by name, in which case we get a series.

In [3]:
df1["tax"]
print(type(df1["tax"]))
df1["tax"]

<class 'pandas.core.series.Series'>

T12341    0.64
T12342    0.55
T12343    0.24
T12344    0.46
T12345    0.15
Name: tax, dtype: float64

If we select a list of columns, we get a data frame.

In [4]:
print(df1[["tax"]])
print(type(df1[["tax"]]))

print(df1[["tax","amount"]])
print(type(df1[["tax","amount"]]))

         tax
T12341  0.64
T12342  0.55
T12343  0.24
T12344  0.46
T12345  0.15
<class 'pandas.core.frame.DataFrame'>
         tax  amount
T12341  0.64   12.75
T12342  0.55   10.89
T12343  0.24    4.67
T12344  0.46   11.21
T12345  0.15    4.00
<class 'pandas.core.frame.DataFrame'>

**Row Selection by position**

To select rows by position, we use iloc - note that we get a pandas series as a result.

The column names become the indices for the series.

In [5]:
print(df1)
print(df1.iloc[1])

         customer  amount   tax  store          datetime payment_method
T12341     George   12.75  0.64      1  12:23:2018:12:38           cash
T12342     Thomas   10.89  0.55      2  12:23:2018:12:45         charge
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash
T12344      Steve   11.21  0.46      1  12:23:2018:12:47         charge
T12345      James    4.00  0.15      2  12:23:2018:12:49           cash
customer                    Thomas
amount                       10.89
tax                           0.55
store                            2
datetime          12:23:2018:12:45
payment_method              charge
Name: T12342, dtype: object

In [5]:
print(df1.iloc[1].name)
s=df1.iloc[1]
type(df1.iloc[1])

T12342

pandas.core.series.Series

In [6]:
s.customer

'Thomas'

Use on left hand side in an assignment

In [7]:
s.customer='Logan'
print(s)

customer                     Logan
amount                       10.89
tax                           0.55
store                            2
datetime          12:23:2018:12:45
payment_method              charge
Name: T12342, dtype: object

C:\Users\dan\AppData\Local\Temp\ipykernel_592\3567991176.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  s.customer='Logan'

In [8]:
df1

         customer  amount   tax  store          datetime payment_method
T12341     George   12.75  0.64      1  12:23:2018:12:38           cash
T12342     Thomas   10.89  0.55      2  12:23:2018:12:45         charge
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash
T12344      Steve   11.21  0.46      1  12:23:2018:12:47         charge
T12345      James    4.00  0.15      2  12:23:2018:12:49           cash

In [15]:
s=df1.iloc[1]
s["customer"]="Logan"

C:\Users\dan\AppData\Local\Temp\ipykernel_19584\3985869810.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  s["customer"]="Logan"

In [9]:
df1.iloc[1,0]="Logan"
df1

         customer  amount   tax  store          datetime payment_method
T12341     George   12.75  0.64      1  12:23:2018:12:38           cash
T12342      Logan   10.89  0.55      2  12:23:2018:12:45         charge
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash
T12344      Steve   11.21  0.46      1  12:23:2018:12:47         charge
T12345      James    4.00  0.15      2  12:23:2018:12:49           cash

If we select multiple rows we get a data frame.

In [10]:
df1.iloc[[0,2,3]]

         customer  amount   tax  store          datetime payment_method
T12341     George   12.75  0.64      1  12:23:2018:12:38           cash
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash
T12344      Steve   11.21  0.46      1  12:23:2018:12:47         charge

We can also specify using ranges

In [11]:
print(df1)
df1.iloc[1:3]

         customer  amount   tax  store          datetime payment_method
T12341     George   12.75  0.64      1  12:23:2018:12:38           cash
T12342      Logan   10.89  0.55      2  12:23:2018:12:45         charge
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash
T12344      Steve   11.21  0.46      1  12:23:2018:12:47         charge
T12345      James    4.00  0.15      2  12:23:2018:12:49           cash

         customer  amount   tax  store          datetime payment_method
T12342      Logan   10.89  0.55      2  12:23:2018:12:45         charge
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash

iloc can also be used to select by row and column

In [23]:
df1

         customer  amount   tax  store          datetime payment_method
T12341     George   12.75  0.64      1  12:23:2018:12:38           cash
T12342      Logan   10.89  0.55      2  12:23:2018:12:45         charge
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash
T12344      Steve   11.21  0.46      1  12:23:2018:12:47         charge
T12345      James    4.00  0.15      2  12:23:2018:12:49           cash

In [20]:
df1.iloc[2,0]

'Josephine'

In [12]:
df1.iloc[2:4,2]

T12343    0.24
T12344    0.46
Name: tax, dtype: float64

In [13]:
df1.iloc[2:4,0:3]

         customer  amount   tax
T12343  Josephine    4.67  0.24
T12344      Steve   11.21  0.46

In [14]:
df1.iloc[[0,1,3],[4,2,5]]

                datetime   tax payment_method
T12341  12:23:2018:12:38  0.64           cash
T12342  12:23:2018:12:45  0.55         charge
T12344  12:23:2018:12:47  0.46         charge

In [24]:
df1.tax.iloc[1:3]

T12342    0.55
T12343    0.24
Name: tax, dtype: float64

**The following fails**

In [15]:
df1.iloc[2,"customer"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

**iat**

We can also select by position using iat, which is faster than iloc, but not as flexible as we can't use ranges.

In [16]:
df1.iat[2,4]

'12:23:2018:12:45'

In [17]:
df1.iat[[2,3],4]

ValueError: iAt based indexing can only have integer indexers

**Selection by index**

To select by index, we use the loc method. 

(Unfortunate chosen word IMHO? "loc" sounds like location and "iloc" sounds like index)

If we select a single observation we get a pandas series object.

In [18]:
print(df1)
print(df1.loc["T12341"])

         customer  amount   tax  store          datetime payment_method
T12341     George   12.75  0.64      1  12:23:2018:12:38           cash
T12342      Logan   10.89  0.55      2  12:23:2018:12:45         charge
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash
T12344      Steve   11.21  0.46      1  12:23:2018:12:47         charge
T12345      James    4.00  0.15      2  12:23:2018:12:49           cash
customer                    George
amount                       12.75
tax                           0.64
store                            1
datetime          12:23:2018:12:38
payment_method                cash
Name: T12341, dtype: object

If we pass a list we get a data frame or a pandas series if the list has only one element.

In [19]:
df1.loc[["T12341","T12343"]]

         customer  amount   tax  store          datetime payment_method
T12341     George   12.75  0.64      1  12:23:2018:12:38           cash
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash

In [30]:
type(df1.loc[["T12341","T12343"]])

pandas.core.frame.DataFrame

In [20]:
df1.loc[["T12342"]]

       customer  amount   tax  store          datetime payment_method
T12342    Logan   10.89  0.55      2  12:23:2018:12:45         charge

We can use loc to select rows and columns.

In [20]:
df1.loc[["T12341","T12342"],"amount"]

T12341    12.75
T12342    10.89
Name: amount, dtype: float64

In [21]:
df1.loc[["T12341","T12342"],["amount","tax"]]

        amount   tax
T12341   12.75  0.64
T12342   10.89  0.55

In [23]:
df2

         customer  amount   tax  store          datetime payment_method
T12341     George   12.75  0.64      1  12:23:2018:12:38           cash
T12342     Thomas   10.89  0.55      2  12:23:2018:12:45         charge
T12343  Josephine    4.67  0.24      3  12:23:2018:12:45           cash
T12344      Steve   11.21  0.46      1  12:23:2018:12:47         charge
T12345      James    4.00  0.15      2  12:23:2018:12:49           cash

**Redefining the index**

In [22]:
df2.set_index('store',inplace=True)

In [24]:
df2

        customer  amount   tax          datetime payment_method
store
1         George   12.75  0.64  12:23:2018:12:38           cash
2         Thomas   10.89  0.55  12:23:2018:12:45         charge
3      Josephine    4.67  0.24  12:23:2018:12:45           cash
1          Steve   11.21  0.46  12:23:2018:12:47         charge
2          James    4.00  0.15  12:23:2018:12:49           cash

In [42]:
df2.loc[1]

      customer  amount   tax          datetime payment_method
store
1       George   12.75  0.64  12:23:2018:12:38           cash
1        Steve   11.21  0.46  12:23:2018:12:47         charge

In [25]:
df2.loc[df2.index==1]

      customer  amount   tax          datetime payment_method
store
1       George   12.75  0.64  12:23:2018:12:38           cash
1        Steve   11.21  0.46  12:23:2018:12:47         charge

In [45]:
df2.iloc[df2.index==1]

      customer  amount   tax          datetime payment_method
store
1       George   12.75  0.64  12:23:2018:12:38           cash
1        Steve   11.21  0.46  12:23:2018:12:47         charge